src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРожденияКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолКлиента</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
// Форма элемента справочника "Контрагенты".
// Динамически изменяет интерфейс в зависимости от типа контрагента:
// для покупателей (физических лиц) показываются поля, связанные с клиентом,
// для остальных (юридических лиц) – поля для договоров и наименования организации.

#Область ОбработчикиСобытийФормы

// Серверный обработчик создания нового элемента.
// Устанавливает тип контрагента по умолчанию, чтобы интерфейс сразу отобразился корректно.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Для нового элемента назначаем тип "Покупатель" (наиболее частый сценарий).
    Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель");
КонецПроцедуры

// Обработчик открытия формы (клиент).
// Выполняет первичную настройку интерфейса согласно текущему типу контрагента.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьПодписьНаименования();
    УправлятьВидимостьюРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик изменения реквизита "ТипКонтрагента".
// При смене типа обновляем заголовок поля "Наименование" и видимость реквизитов.
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
    // Защита от Неопределено (на случай, если значение сброшено).
    Если Объект.ТипКонтрагента = Неопределено Тогда
        Возврат;
    КонецЕсли;
    УстановитьПодписьНаименования();
    УправлятьВидимостьюРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Меняет заголовок поля "Наименование" в зависимости от типа контрагента.
// Для покупателя (физического лица) заголовок становится "ФИО",
// для всех остальных – "Наименование" (юридическое лицо).
&НаКлиенте
Процедура УстановитьПодписьНаименования()
    Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель") Тогда
        Элементы.Наименование.Заголовок = "ФИО";
    Иначе
        Элементы.Наименование.Заголовок = "Наименование";
    КонецЕсли;
КонецПроцедуры

// Управляет видимостью дополнительных реквизитов формы в зависимости от типа контрагента.
// Для покупателя видны: "ДатаРожденияКлиента", "ПолКлиента", "Источник".
// Скрыты: "Договор".
// Для остальных типов – наоборот.
&НаКлиенте
Процедура УправлятьВидимостьюРеквизитов()
    Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель") Тогда
        Элементы.ДатаРожденияКлиента.Видимость   = Истина;
        Элементы.ПолКлиента.Видимость            = Истина;
        Элементы.Договор.Видимость               = Ложь;
        Элементы.Источник.Видимость              = Истина;
    Иначе
        Элементы.ДатаРожденияКлиента.Видимость   = Ложь;
        Элементы.ПолКлиента.Видимость            = Ложь;
        Элементы.Договор.Видимость               = Истина;
        Элементы.Источник.Видимость              = Ложь;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти
